import json
from accounts.models import Province, City
from django.core.management.base import BaseCommand

class Command(BaseCommand):

    def handle(self, *args, **kwargs):
        data = {
            "تهران": ["تهران", "اسلام‌شهر", "ورامین", "ری"],
            "اصفهان": ["اصفهان", "کاشان", "نجف‌آباد", "خمینی‌شهر"],
            "فارس": ["شیراز", "مرودشت", "جهرم", "لار"],
            "خراسان رضوی": ["مشهد", "نیشابور", "سبزوار", "تربت‌حیدریه"],
            "آذربایجان شرقی": ["تبریز", "مرند", "میانه", "اهر"],
            "آذربایجان غربی": ["ارومیه", "خوی", "ماکو", "مهاباد"],
            "تهران": ["تهران", "اسلام‌شهر", "ری", "شمیرانات"],
            "خوزستان": ["اهواز", "دزفول", "ماهشهر", "اندیمشک"],
            "فارس": ["شیراز", "کازرون", "مرودشت", "فسا"],
            "البرز": ["کرج", "طالقان", "محمودآباد", "نظرآباد"],
            "گیلان": ["رشت", "لاهیجان", "تالش", "ماکلوان"],
            "مازندران": ["ساری", "بابل", "آمل", "قائم‌شهر"],
            "کردستان": ["سنندج", "قروه", "بانه", "بیجار"],
            "کرمان": ["کرمان", "رفسنجان", "سیرجان", "جیرفت"],
            "یزد": ["یزد", "میبد", "تفت", "اردکان"],
            "سمنان": ["سمنان", "شاهرود", "دامغان", "گرمسار"],
            "کرمانشاه": ["کرمانشاه", "اسلام‌آبادغرب", "صحنه", "نودشه"],
            "همدان": ["همدان", "ملایر", "نهاوند", "بهار"],
            "چهارمحال‌و‌بختیاری": ["شهرکرد", "بروجن", "فارسان", "لردگان"],
            "کردکان": ["نقده", "خوی", "مهاباد", "بوکان"],
            "کهگیلویه‌وبویراحمد": ["یاسوج", "دوگنبدان", "قلعه‌ربیع", "سوق"],
            "لرستان": ["خرم‌آباد", "بروجرد", "دورود", "الشتر"],
            "گیلان": ["رشت", "لاهیجان", "آستانه", "تالش"],
            "زنجان": ["زنجان", "ابهر", "خرمدره", "ماه‌نشان"],
            "بوشهر": ["بوشهر", "دشتستان", "کنگان", "گناوه"],
            "خراسان جنوبی": ["بیرجند", "قائن", "فردوس", "نهبندان"],
            "خراسان شمالی": ["بجنورد", "شیروان", "اسفراین", "جاجرم"],
            "سیستان و بلوچستان": ["زاهدان", "زابل", "چابهار", "سراوان"],
            "فارس": ["شیراز", "مرودشت", "فسا", "جهرم"],
            "قزوین": ["قزوین", "بوئین‌زهرا", "آبیک", "البرز"],
            "قم": ["قم"],
            "گلستان": ["گرگان", "گنبدکاووس", "آق‌قلا", "کردکوی"],
            "هرمزگان": ["بندرعباس", "قشم", "بندرلنگه", "میناب"],
            "مرکزی": ["اراک", "خمین", "دلیجان", "محلات"],
            "هرمزگان": ["بندرعباس", "قشم", "بندر لنگه", "میناب"],
            "یزد": ["یزد", "میبد", "اردکان", "مهریز"]
        }

        Province.objects.all().delete()
        City.objects.all().delete()

        for province_name, cities in data.items():
            province = Province.objects.create(name=province_name)
            for city_name in set(cities):
                City.objects.create(name=city_name, province=province)

        self.stdout.write(self.style.SUCCESS(' ✅'))
